experiments/resource_stress/wrk.txt
Running 1m test @ http://127.0.0.1:8080/
  2 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.06ms    5.34ms  72.58ms   75.27%
    Req/Sec     1.94k   263.36     3.11k    72.08%
  232323 requests in 1.00m, 36.34MB read
Requests/sec:   3867.80
Transfer/sec:    619.45KB