experiments/resource_stress/wrk_during_stress.txt
Running 1m test @ http://localhost:8080/
  2 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    19.82ms   20.76ms 387.67ms   80.54%
    Req/Sec     1.84k   462.81     4.62k    71.49%
  219319 requests in 1.00m, 34.30MB read
  Socket errors: connect 0, read 0, write 0, timeout 100
Requests/sec:   3659.98
Transfer/sec:    586.17KB